Repository: jhermoso/Inflexion2
Catalog: 03-GeneratedProjects/Atento.Suite.Shared.Infrastructure.Resources/SharedResources.*.resx
Languages: de, it

source: Actualizar Esquema Product
de: Schema-Produkt aktualisieren
it: Aggiornamento dello Schema prodotto

# Any
source: ninguno
it: Nessuno

source: Añadir Datos Maqueta Product
de: Datenmodell Produkt hinzufügen
it: Aggiungere il modello di dati prodotto

source: Ayuda
de: Hilfe
it: Guida

source: Borrar Datos Maqueta Product
de: Datenmodell Produkt löschen
it: Eliminare i dati del modello prodotto

source: Borrar y Crear Esquema Product
de: Löschen Sie und erstellen Sie Schema Produkt
it: Eliminare e creare schema prodotto

# Categoria_NameAlias
source: Name
it: Nome

# Categoria_NameTooltip
source: Name
it: Nome

# Categoria_NameUserRemarks
source: Name
it: Nome

# CategoriaRemarks
source: Clasificador
de: Sichter
it: Classificatore

# CategoriaTooltip
source: Clasificación
de: Klassifizierung
it: Classificazione

source: Contexto Limitado
it: Contesto limitato

source: contraseña
de: Passwort:
it: password:

# Elobjetodeestaaplicacióneselde
source: El objeto de esta aplicación es el de generar y actualizar las basesde datos de cada uno de los contextos limitado o de los módulos de la aplicación.Para ello se tiene una pestaña para cada uno de los contextos limitados que se han modelado y dentro de cada uno de estos contextosse puede crear una estructura de base de datos. Si existe la versión existente se destruye previamente. Actualizar el esquema de la base de datos el cual no destruye la versión anterior ni borra los datos existentes mientras la actualización no destruya ninguan tabla en cuyo caso si se destruiria. Y por ultimo añadir registros con contenido aleatorio para poder realizar pruebas.Todas estas operaciones exigen que en el sistema de bases datos se haya dado de alta dicha base de datos aunque no es ncesario que dicha base de datos tenga ningún esquema
de: Der Zweck dieser Anwendung ist das generieren und aktualisieren Sie die Grundlagen der Kontexte beschränkt oder Module der Anwendungsdaten. Dies ist ein Register aller begrenzten Kontexten, die geprägt haben und in jedem von diesen Contextosse können Sie eine Datenbankstruktur erstellen. Wenn die Version existiert bestehenden zuvor zerstört wurden. Aktualisieren Sie das Schema der Datenbank, die die vorherige Version nicht zerstört oder vorhandene Daten löscht, während das Update nicht nicht-Tabelle in diesem Fall zerstört wenn Sie verwischen. Und zu guter Letzt fügen Datensätze mit zufälligen Inhalt Tests durchzuführen. Alle diese Vorgänge erfordern, dass im System der Basen, die Daten sind von hoher dieser Datenbank zwar nicht gegeben hat ist erforderlich, dass diese Datenbank kein Schema hat
it: Lo scopo di questa applicazione è il generare e aggiornare le basi dei contesti limitati o moduli di dati dell'applicazione. Si tratta di una scheda per ognuno dei contesti limitati che hanno plasmato e all'interno di ciascuna di queste contextosse è possibile creare una struttura di database. Se c'è la versione esistente viene eliminata in precedenza. Aggiornare lo schema del database che non distrugge la versione precedente o Elimina i dati esistenti, mentre l'aggiornamento non distrugge tabella di non discriminazione nel qual caso se annienta. E infine aggiungere record con contenuto casuale per essere in grado di eseguire test. Tutte queste operazioni richiedono che nel set di basi dati dati alto questo database anche se non è necessario che il database non ha nessun schema

# EnumeracionAlias
source: Enumeracion
de: Aufzählung
it: Enumerazione

# EnumeracionRemarks
source: Enumeracion
de: Aufzählung
it: Enumerazione

# EnumeracionTooltip
source: Enumeracion
de: Aufzählung
it: Enumerazione

# German
source: Alemán
de: Deutsch
it: Tedesco

source: Gestor de Esquemas de BD
de: Schema-Manager von BD
it: Gestione schema di BD

# Hebrew
source: Hebreo
de: Hebräisch
it: Ebraico

source: Nombre de la base de datos:
de: Name der Datenbank:
it: Nome del database:

source: Nombre del servidor:
it: Nome del server:

source: Nombre de usuario
de: Name des Benutzers
it: Nome utente

source: Open
de: Offen
it: Aperto

# Persona_BooleanFieldAlias
source: Boolean Field
de: Boolesches Feld
it: Campo Boolean

# Persona_BooleanFieldTooltip
source: Boolean Field
de: Boolesches Feld
it: Campo Boolean

# Persona_BooleanFieldUserRemarks
source: Boolean Field
de: Boolesches Feld
it: Campo Boolean

# Persona_ByteFieldAlias
source: Byte Field
de: Byte-Feld
it: Campo byte

# Persona_ByteFieldTooltip
source: Byte Field
de: Byte-Feld
it: Campo byte

# Persona_ByteFieldUserRemarks
source: Byte Field
de: Byte-Feld
it: Campo byte

# Persona_DatetimeFieldAlias
source: Datetime Field
de: DateTime-Feld
it: Campo DateTime

# Persona_DatetimeFieldTooltip
source: Datetime Field
de: DateTime-Feld
it: Campo DateTime

# Persona_DatetimeFieldUserRemarks
source: Datetime Field
de: DateTime-Feld
it: Campo DateTime

# Persona_DateTimeOffsetFieldAlias
source: Date Time Offset Field
de: Datumsfeld Zeit Offset
it: Data Time Offset campo

# Persona_DateTimeOffsetFieldTooltip
source: Date Time Offset Field
de: Datumsfeld Zeit Offset
it: Data Time Offset campo

# Persona_DateTimeOffsetFieldUserRemarks
source: Date Time Offset Field
de: Datumsfeld Zeit Offset
it: Data Time Offset campo

# Persona_DecimalFieldAlias
source: Decimal Field
de: Dezimale Feld
it: Campo decimale

# Persona_DecimalFieldTooltip
source: Decimal Field
de: Dezimale Feld
it: Campo decimale

# Persona_DecimalFieldUserRemarks
source: Decimal Field
de: Dezimale Feld
it: Campo decimale

# Persona_DobleFieldAlias
source: Doble Field
de: Double-Feld
it: Doppio campo

# Persona_DobleFieldTooltip
source: Doble Field
de: Double-Feld
it: Doppio campo

# Persona_DobleFieldUserRemarks
source: Doble Field
de: Double-Feld
it: Doppio campo

# Persona_FloatFieldAlias
source: Float Field
de: Float-Bereich
it: Campo di tipo float

# Persona_FloatFieldTooltip
source: Float Field
de: Float-Bereich
it: Campo di tipo float

# Persona_FloatFieldUserRemarks
source: Float Field
de: Float-Bereich
it: Campo di tipo float

# Persona_GuidFieldAlias
source: Guid Field
de: GUID-Feld
it: Campo GUID

# Persona_GuidFieldTooltip
source: Guid Field
de: GUID-Feld
it: Campo GUID

# Persona_GuidFieldUserRemarks
source: Guid Field
de: GUID-Feld
it: Campo GUID

# Persona_Int16FieldAlias
source: Int16 Field
de: Int16 Feld
it: Campo Int16

# Persona_Int16FieldTooltip
source: Int16 Field
de: Int16 Feld
it: Campo Int16

# Persona_Int16FieldUserRemarks
source: Int16 Field
de: Int16 Feld
it: Campo Int16

# Persona_Int32FieldAlias
source: Int32 Field
de: Int32-Feld
it: Campo Int32

# Persona_Int32FieldTooltip
source: Int32 Field
de: Int32-Feld
it: Campo Int32

# Persona_Int32FieldUserRemarks
source: Int32 Field
de: Int32-Feld
it: Campo Int32

# Persona_Int64FieldAlias
source: Int64 Field
de: Int64-Feld
it: Campo Int64

# Persona_Int64FieldTooltip
source: Int64 Field
de: Int64-Feld
it: Campo Int64

# Persona_Int64FieldUserRemarks
source: Int64 Field
de: Int64-Feld
it: Campo Int64

# Persona_IntFieldAlias
source: Int Field
de: Int Feld
it: Campo int

# Persona_IntFieldTooltip
source: Int Field
de: Int Feld
it: Campo int

# Persona_IntFieldUserRemarks
source: Int Field
de: Int Feld
it: Campo int

# Persona_LongFieldAlias
source: Long Field
de: Langen Feld
it: Campo lungo

# Persona_LongFieldTooltip
source: Long Field
de: Langen Feld
it: Campo lungo

# Persona_LongFieldUserRemarks
source: Long Field
de: Langen Feld
it: Campo lungo

# Persona_Nombre
source: La property'Nombre' de la entidad 'Persona' tiene una longitud mínima de y una longitud máxima de '
de: Die property'Nombre' der Entität "Persona" hat ein Minimun Länge und einer maximalen Länge von "
it: La property'Nombre' dell'entità 'Persona' ha una lunghezza minima di e una lunghezza massima di '

# Persona_NombreAlias
source: Nombre
de: Name
it: Nome

# Persona_NombreTooltip
source: Nombre
de: Name
it: Nome

# Persona_NombreUserRemarks
source: Nombre
de: Name
it: Nome

# Persona_ShortFieldAlias
source: Short Field
de: Kurze Feld
it: Campo corto

# Persona_ShortFieldTooltip
source: Short Field
de: Kurze Feld
it: Campo corto

# Persona_ShortFieldUserRemarks
source: Short Field
de: Kurze Feld
it: Campo corto

# Persona_TimeSpanFieldAlias
source: Télefono
de: Telefon
it: Telefono

# Persona_TimeSpanFieldTooltip
source: Time Span Field
de: Feld "Time Span"
it: Campo Span ora

# Persona_TimeSpanFieldUserRemarks
source: Time Span Field
de: Feld "Time Span"
it: Campo Span ora

# PersonaRemarks
source: datos acerca de personas fisica y juridicas.
de: Daten über natürliche und juristische Personen.
it: dati relativi a persone fisiche e giuridiche.

# PersonaTooltip
source: Repositorio de personas físicas o juridicas.
de: Repository von natürlichen Personen oder juristischen Personen.
it: Repository di persone fisiche o giuridiche.

# Portuguese
source: Portugués
de: Portugiesisch
it: Portoghese

source: Script Actualización:
it: Aggiornamento di script:

source: Script Creación:
de: Skripterstellung:
it: Creazione di script:

# ScriptSqlBorraryCrearEsquemaPr
source: Script Sql Borrar y Crear Esquema Product
de: Sql Skript löschen und erstellen Sie Schema Produkt
it: Script Sql eliminare e creare schema prodotto

# SelectLanguage
source: Seleccione su idioma
de: Wählen Sie Ihre Sprache
it: Seleziona la tua lingua

# SelectTheme
source: Seleccione el estilo de interface
it: Selezionare lo stile dell'interfaccia

source: Tecnología de la base de datos:
de: Technologie der Datenbank:
it: Database tecnologico:

source: usuario
de: Benutzer:
it: utente:

# CategoriaAlias
source: Categoria
de: Kategorie

# English
source: Inglés
de: Englisch

# Italian
source: Italiano
de: Italienisch

# PersonaAlias
source: Persona
de: Person

source: Sistema Operativo
de: Betriebssystem

# Spanish
source: Español
de: Spanisch
