Repository: jhermoso/Inflexion2
Catalog: 04-T4/ModelDriver/Assets/CreateDataBase/Resources/CreateProductDataBase.*.resx
Languages: it_it, pt_pt

source: Alignment:
it_it: Allineamento
pt_pt: Alinhamento

source: Application Settings
it_it: Impostazioni dell'applicazione
pt_pt: Configurações do aplicativo

source: Bureau Black
it_it: Ufficio Black
pt_pt: Black Mesa

source: Bureau Blue
it_it: Ufficio blu
pt_pt: Mesa azul

source: Center
it_it: Centro
pt_pt: Centro

source: Close
it_it: Chiudere
pt_pt: Fechar

# Color
source: Colour
it_it: Colore
pt_pt: Cor

source: Control Settings
it_it: Impostazioni di controllo
pt_pt: Configurações de controle

# Demoofderivedwindowwithsetting
source: Demo of derived window with settings
it_it: Demo di derivata finestra con le impostazioni
pt_pt: Demonstração da janela derivada com configurações

source: Demo of list view settings
it_it: Demo di impostazioni di visualizzazione elenco
pt_pt: Demo de configurações de exibição de lista

source: Demo of XAML driven settings
it_it: Demo di XAML guidata impostazioni
pt_pt: Demo de XAML controladas por configurações

source: Derived Window
it_it: Finestra derivata
pt_pt: Janela derivada

source: Expression Dark
it_it: Espressione Dark
pt_pt: Expressão Dark

source: Expression Light
it_it: Luce di espressione
pt_pt: Luz de expressão

source: Left
it_it: Sinistra
pt_pt: Esquerda

source: Location:
it_it: Ubicazione
pt_pt: Localização

# Ninguno
source: None
it_it: Nessuno
pt_pt: Nenhum

source: Open
it_it: Aperto
pt_pt: Aberto

source: Open user.config
it_it: Aprire user. config
pt_pt: Abra o User. config

source: Reload last saved window settings
it_it: Ricarica ultimo salvataggio delle impostazioni della finestra
pt_pt: Recarregar a últimos janela salva configurações

source: Reload Settings
it_it: Ricaricare le impostazioni
pt_pt: Recarregar as configurações

source: Reset Settings
it_it: Ripristinare le impostazioni
pt_pt: Redefinir configurações

# Resetwindowsettingstothedefaul
source: Reset settings to the default window
it_it: Reimpostare le impostazioni nella finestra di impostazione predefinita
pt_pt: Redefinir as configurações para a janela padrão

source: Right
it_it: Diritto
pt_pt: Direito

source: Save as Default
it_it: Salva come Default
pt_pt: Salvar como padrão

# Savecurrentwindowsettings
source: Save current settings window
it_it: Salvare la finestra impostazioni corrente
pt_pt: Salvar a janela de configurações atual

source: Save Settings
it_it: Salvare le impostazioni
pt_pt: Salvar configurações

source: Save window settings on close
it_it: Salvare le impostazioni della finestra su Chiudi
pt_pt: Salvar configurações de janela em Fechar

source: Selected Item
it_it: Elemento selezionato:
pt_pt: Item selecionado:

source: Select Theme
it_it: Selezionare il tema
pt_pt: Selecione o tema

source: Shiny Blue
it_it: Blu lucido
pt_pt: Azul brilhante

source: Shiny Red
it_it: Rosso lucido
pt_pt: Vermelho brilhante

source: Size
it_it: Dimensioni
pt_pt: Tamanho

source: Splitter Position:
it_it: Sdoppiatore posizione
pt_pt: Posição do separador

source: User Configuration
it_it: Configurazione utente
pt_pt: Configuração de usuário

# UserSettingsAppliedWPFCodeBehi
source: User Settings Applied - WPF Code Behind
it_it: Impostazioni utente applicata - codice WPF dietro
pt_pt: As configurações de usuário aplicada - código por trás do WPF

source: Whistler Blue
pt_pt: Whistler azul

source: Window Settings
it_it: Finestra impostazioni
pt_pt: Janela configurações

source: Window State:
it_it: Stato della finestra
pt_pt: Estado de janela

source: XAML Settings
it_it: Impostazioni di XAML
pt_pt: Configurações de XAML
