Repository: jhermoso/Inflexion2
Catalog: 01-Projects/Inflexion2.Resources/FrameworkResource.*.resx
Languages: ar, de, es, fr, he, it, ja, pt, zh

# UnitOfWorkIsNull
source: the unit of work is null
ar: ووحدة العمل null
de: Die Arbeitseinheit ist null
es: la unidad de trabajo es nula
fr: l’unité de travail est nulle
he: יחידת עבודה הוא null
it: l'unità di lavoro è null
ja: 仕事の単位は null
pt: a unidade de trabalho é nula
zh: 工作单元为空

# Update
source: Update {0}
ar: تحديث {0}
es: Actualización {0}
fr: Mise à jour {0}
he: עדכון {0}
it: Aggiornamento {0}
ja: {0} を更新します。
pt: Atualizar {0}
zh: 更新{0}

# User
source: User {0}
ar: المستخدم {0}
de: Benutzer {0}
es: Usuario {0}
fr: L’utilisateur {0}
he: המשתמש {0}
it: Utente {0}
ja: ユーザー {0}
pt: Usuário {0}
zh: 用户{0}

source: User Name
ar: اسم المستخدم
de: Benutzername
es: Nombre de usuario
fr: Nom d’utilisateur
he: שם משתמש
it: Nome utente
ja: ユーザー名
pt: Nome de usuário
zh: 用户名

# ValueIsNotAnEmail
source: {0} value is not an email
ar: القيمة {0} غير رسالة بريد إلكتروني
de: {0} Wert ist keine e-Mail
es: el valor {0} no es un correo electrónico
fr: valeur de {0} n’est pas un email
he: הערך {0} אינה הודעת דוא
it: valore di {0} non è una mail
ja: {0} の値が電子メール
pt: valor de {0} não é um e-mail
zh: {0}值不是电子邮件

# ValueIsNotCorrectlyFormatted
source: {0} value is not correctly formatted
ar: القيمة {0} غير مهيأ بشكل صحيح
de: {0} Wert ist nicht korrekt formatiert.
es: valor {0} no está formateado correctamente
fr: valeur de {0} n’est pas correctement formaté
he: הערך {0} לא מעוצב כראוי
it: valore di {0} non è formattato correttamente
ja: {0} 値が正しくフォーマットされていません
pt: valor de {0} não está formatado corretamente
zh: {0}值格式不正确

# ValueIsNotOfTheCorrectType
source: {0} value is not of the correct type
ar: القيمة {0} ليست من النوع الصحيح
de: {0} Wert ist nicht vom richtigen Typ
es: el valor {0} no es del tipo correcto
fr: valeur de {0} n’est pas du type correct
he: הערך {0} הוא לא מהסוג הנכון
it: valore di {0} non è del tipo corretto
ja: {0} 値が正しい型の
pt: valor de {0} não é do tipo correto
zh: {0}值的类型不正确

# ValueMustBeBetween1And2
source: {0} value must be between {1} and {2}
ar: يجب أن تكون قيمة {0} {1} بين {2}
de: {0} Wert muss zwischen {1} und {2}
es: valor {0} debe estar entre {1} y {2}
fr: valeur de {0} doit être comprise entre {1} et {2}
he: הערך {0} חייב להיות בין {{2}2}
it: valore di {0} deve essere compresa fra {1} e {2}
ja: {0} 値は {1} から {2} 間でなければなりません
pt: valor de {0} deve estar compreendida entre {1} e {2}
zh: {0}值必须在{1}和{2}之间

# flow
source: LeftToRight
ar: RightToLeft
he: RightToLeft
zh: 左到右

source: Access
ar: وصول
de: Zugriff
es: Acceso
fr: accès
he: גישה
it: Accesso
ja: アクセス
pt: Acesso
zh: 访问

source: Login
ar: دخول
de: Anmeldung
he: התחברות
ja: ログイン
zh: 登录

# SaveMessage
source: Save {0}
ar: حفظ {0}
de: Speichern Sie {0}
fr: Enrigstrer {0}
he: שמירת הודעה{0}
it: Salva {0}
ja: セーブ {0}
pt: Salvar
zh: 保存{0}

source: Save record
ar: حفظ السجل
de: Datensatz speichern
es: Guardar registro
fr: Conserveur la fiche
he: שמור רשום
it: Salva record
ja: レコードの保存
pt: Conservar a ficha
zh: 保存记录

source: New
ar: الجديد
de: Neu
es: Nuevo
fr: Nouveau
he: חָדָשׁ
it: Nuovo
ja: 新しい
pt: Novo
zh: 新

source: Add
ar: إضافة
de: Hinzufügen
es: Añadir
fr: Ajouter
he: לְהוֹסִיף
it: Aggiungere
ja: 加えます
pt: Adicionar
zh: 加

source: Add New Record
ar: إضافة سجل جديد
de: Neuen Datensatz hinzufügen
es: Añadir nuevo registro
fr: Ajouter un nouvel enregistrement
he: להוסיף שיא חדש
it: Aggiungi nuovo record
ja: 新しいレコードを追加
pt: Adicionar novas informações
zh: 添加新记录

source: Edit
ar: تحرير
de: Bearbeiten
es: Editar
fr: Modifier
he: לַעֲרוֹך
it: Modifica
ja: 編集
pt: Editar
zh: 编辑

source: Edit record
ar: تحرير سجل
de: Datensatz bearbeiten
es: Editar registro
fr: Modifier la fiche
he: עדכון רשום
it: Modifica record
ja: レコード編集
pt: Editar gravar
zh: 编辑记录

source: Delete record
ar: حذف سجل
de: Datensatz löschen
es: Borrar registro
fr: Supprimer l'engistrement
he: מחק רשום
it: Elimina record
ja: レコードを削除します
pt: Borrar registro
zh: 删除记录

source: Get
ar: الحصول على
de: Erhalten
es: Obtener
fr: Obtenez
he: לקבל
it: ottenere
ja: 取得する
pt: Obter
zh: 得到

# SearchMessage
source: Search {0}
ar: البحث {0}
de: Suche {0}
es: Buscar {0}
fr: Rechercher {0}
he: הודעה חפש
it: Cerca {0}
ja: サーチ {0}
pt: Pesquisa
zh: 搜索{0}

source: First
ar: الأولى
de: Zuerst
es: Primero
fr: Premier
he: ראשון
it: Primo
ja: 最初
pt: Primeiro
zh: 第一

source: First Page
ar: الصفحة الأولى
de: Erste Seite
es: Primera página
fr: Premier page
he: עמוד ראשון
it: Primo pagina
ja: 一ページ目
pt: Primeira página
zh: 第一页

source: Next
ar: القادم
de: Nächster
es: Siguiente
fr: Prochain
he: הַבָּא
it: Il prossimo
ja: 次
pt: Próximo
zh: 下一个

source: Next page
ar: الصفحة التالية
de: Folgeseite
es: Siguiente página
fr: Page suivante
he: עמוד הבא
it: Pagina successiva
ja: 次のページ
pt: Próxima página
zh: 下一页

source: Paging
ar: ترحيل الصفحات
es: Paginado
fr: Pagination
he: החלפה
ja: ページング
pt: paginação
zh: 分页

source: Previous
ar: السابقة
de: Zurück
es: Anterior
fr: Précédent
he: קודם
it: Precendente
ja: 前
pt: Anterior
zh: 以前

source: Previous Page
ar: الصفحة السابقة
de: Vorheige Seite
es: Página anterior
fr: Page Précédente
he: עמוד קודם
it: Pagina precedente
ja: 前のページ
pt: Página anterior
zh: 上一页

source: Last
ar: الماضي
de: Letze
es: Ultimo
fr: Dernier
he: אחרון
it: Ultimo
ja: 最終
pt: Último
zh: 持续

source: LastPage
ar: لاستباجي
de: Letze Seite
es: Ultima página
fr: Dernier page
he: עמוד אחרון
it: Ultima pagina
ja: 最後のページ
pt: Última página
zh: 最后一页

source: Delete
ar: حذف
de: löschen
he: למחוק
ja: 削除
pt: Eliminar
zh: 删除

source: Home
ar: الصفحة الرئيسية
de: Zuhause
he: בית
ja: 自宅
zh: 家
