Repository: jhermoso/Inflexion2
Catalog: 01-Projects/Inflexion2.Resources/FrameworkResource.*.resx
Languages: ar, de, es, fr, he, it, ja, pt, zh

# Acept
source: Accept
ar: أسيبت
de: akzeptieren
es: Acepto
fr: Acept
he: לְקַבֵּל
it: Acept
ja: 受け入れ
pt: Acept
zh: 接受

source: An object of type {0} was not available from the pool
ar: لم يكن كائن من النوع {0} متاح من تجمع
de: Ein Objekt vom Typ {0} wurde nicht aus dem pool
es: Un objeto de tipo {0} no estaba disponible de la piscina
fr: Un objet de type {0} ne disposait pas de la piscine
he: אובייקט מסוג {0} לא היה זמין מן הבריכה
it: Un oggetto di tipo {0} non era disponibile dal pool
ja: 型 {0} のオブジェクトからできませんでした、プール
pt: Um objeto do tipo {0} não estava disponível do pool
zh: 类型为{0}的对象不可从池中使用

source: Cancel
ar: إلغاء الأمر
de: Abbrechen
es: Cancelar
fr: Annuler
he: ביטול
it: Annulla
ja: キャンセル
pt: Cancelar
zh: 取消

# Canceled
source: {0} canceled
ar: إلغاء {0}
de: {0} abgebrochen
es: {0} cancelado
fr: {0} annulée
he: {0} בוטל
it: {0} annullato
ja: {0} キャンセル
pt: {0} cancelada
zh: 已取消{0}

# CanNotDeactivate
source: The {0} can't be deactivated.
ar: لا يمكن إلغاء تنشيط {0}.
de: {0} kann nicht deaktiviert werden.
es: {0} no se puede desactivar.
fr: {0} ne peut pas être désactivé.
he: {0} לא יופעלו.
it: Il {0} non può essere disattivato.
ja: {0} を非アクティブ化することはできません。
pt: O {0} não pode ser desativado.
zh: 不能取消激活{0}。

# CanNotDelete
source: The {0} can't be deleted.
ar: لا يمكن حذف {0}.
de: {0} kann nicht gelöscht werden.
es: {0} no se puede eliminar.
fr: {0} ne peut pas être supprimé.
he: אין אפשרות למחוק את {0}.
it: Il {0} non può essere eliminato.
ja: {0} を削除できません。
pt: O {0} não pode ser excluído.
zh: 无法删除{0}。

source: Can not directly save a child object
ar: لا يمكنك حفظ صورة مباشرة كائن تابع
de: Kann nicht direkt ein untergeordnetes Objekt speichern
es: No puede guardar directamente un objeto secundario
fr: Ne peut pas directement enregistrer un objet enfant
he: ישירות לא יציל את אובייקט צאצא
it: Non è possibile salvare direttamente un oggetto figlio
ja: 子オブジェクトを直接保存することができます。
pt: Não pode salvar diretamente um objeto filho
zh: 无法直接保存子对象

# CanNotUpdateInexistenceEntity
source: Can Not Update Inexistence Entity {0}.
ar: لا يمكن تحديث عدم وجود كيان {0}.
de: Fehlens Entität {0} kann nicht aktualisiert werden.
es: No se puede actualizar la inexistencia entidad {0}.
fr: Peut pas mettre à jour l’entité Inexistence {0}.
he: לא ניתן לעדכן Inexistence הישות {0}.
it: Non è possibile aggiornare inesistenza entità {0}.
ja: 存するエンティティ {0} を更新できません。
pt: Pode não atualizar a inexistência de entidade {0}.
zh: 无法更新不存在实体{0}。

source: Certificate file name format not valid. 'file|password'
ar: شهادة تنسيق اسم ملف غير صالح. 'ملف | كلمة المرور'
de: Zertifikat-Datei Namensformat nicht gültig. "Datei | Passwort"
es: Certificado nombre formato no válido. ' archivo | contraseña '
fr: Format de nom fichier certificat non valide. « fichier | mot de passe "
he: אישור שם תבנית הקובץ אינה חוקית. ' קובץ | הסיסמה '
it: Formato del nome file certificato non valido. ' file | password'
ja: 証明書ファイル名の形式が無効です。' ファイル | パスワード '
pt: Formato de nome arquivo certificado não é válido. ' arquivo | senha '
zh: 证书文件名格式无效。 'file | password'

source: Code: {0} was not present in data set collection
ar: التعليمات البرمجية: {0} لم يكن حاضرا في جمع البيانات مجموعة
de: Code: {0} wurde nicht im Datensatz Sammlung vorhanden
es: Código: {0} no estaba presente en la colección de datos
fr: Code : {0} n’était pas présent dans la collection de l’ensemble de données
he: קוד המוצר: {0} לא היה נוכח באוסף ערכת נתונים
it: Codice: {0} non era presente nell'insieme di set di dati
ja: コード: {0} がデータ セットのコレクションに存在しませんでした。
pt: Código: {0} não estava presente na coleção de conjunto de dados
zh: 代码：{0}不存在于数据集集合中

source: Code Field Name not specified. Unable to Fetch by code.
ar: لم يتم تحديد "اسم الحقل" التعليمات البرمجية. غير قادر على إحضار من التعليمات البرمجية.
de: Code-Feld-Namen nicht angegeben. Nicht in der Lage zu holen von Code.
es: Código nombre del campo no especificado. Incapaz de Fetch por código.
fr: Nom de domaine code non précisés. Impossible de chercher par code.
he: לא צוין שם של שדה קוד. אין אפשרות להביא לפי קוד.
it: Nome del campo codice non specificato. Grado di recupero dal codice.
ja: コード フィールド名が指定されていません。コードで取得することができません。
pt: Nome do campo de código não especificado. Não é possível buscar por código.
zh: 未指定代码字段名称。无法通过代码获取。

# CollectionCantBeNull
source: The collection of {0} can't be null
ar: جمع {0} لا يمكن أن يكون فارغاً
de: Die Sammlung von {0} kann nicht null sein.
es: La colección de {0} no puede ser nula
fr: La collection de {0} ne peut pas être nulle
he: האוסף של {0} אינו יכול להיות null
it: La collezione di {0} non può essere null
ja: {0} のコレクションを null にすることはできません。
pt: A coleção de {0} não pode ser nula
zh: {0}的集合不能为空

source: Could not CreateType
ar: يمكن أن لا كريتيتيبي
de: Konnte nicht CreateType
es: Podría no CreateType
fr: Pouvait pas CreateType
he: יכול לא CreateType
it: Potrebbe non CreateType
ja: ない CreateType を可能性があります。
pt: Poderia não CreateType
zh: 无法创建类型

source: Could not DefineType
ar: يمكن أن لا ديفينيتيبي
de: Könnte nicht DefineType
es: Podría no DefineType
fr: Pouvait pas DefineType
he: יכול לא DefineType
it: Potrebbe non DefineType
ja: DefineType ないを可能性があります。
pt: Poderia não DefineType
zh: 无法定义类型

source: Could not generate assembly
ar: تعذر إنشاء الجمعية
de: Assembly konnte nicht generiert werden.
es: No pudo generar Asamblea
fr: Pas pu générer d’Assemblée
he: לא היתה אפשרות להפיק הרכבה
it: Impossibile generare l'assembly
ja: アセンブリを生成できませんでした。
pt: Não foi possível gerar o conjunto
zh: 无法生成装配

source: Could not generate module builder
ar: تعذر إنشاء منشئ الوحدة النمطية
de: Modul-Generator konnte nicht generiert werden.
es: No pudo generar constructor de módulo
fr: Pas pu générer de constructeur de module
he: לא היתה אפשרות להפיק מודול בונה
it: Impossibile generare generatore di modulo
ja: ビルダー モジュールを生成できませんでした。
pt: Não foi possível gerar o construtor de módulo
zh: 无法生成模块构建器

source: creationTimeout cannot be negative
ar: كريتيونتيميوت لا يمكن أن تكون سلبية
de: CreationTimeout darf nicht negativ sein.
es: creationTimeout no puede ser negativo
fr: creationTimeout ne peut pas être négatif
he: creationTimeout אינו יכול להיות שלילי
it: creationTimeout non può essere negativo
ja: creationTimeout は負の値にすることはできません。
pt: creationTimeout não pode ser negativo
zh: 创建超时不能为负

source: DataLayerService can't be null
ar: داتالاييرسيرفيسي لا يمكن أن يكون فارغاً
de: DataLayerService darf nicht null sein.
es: DataLayerService no puede ser nulo
fr: DataLayerService ne peut pas être null
he: DataLayerService אינו יכול להיות null
it: DataLayerService non può essere null
ja: DataLayerService を null にすることはできません。
pt: DataLayerService não pode ser nulo
zh: 数据层服务不能为空

# DataTransferObjectIsNull
source: The entity {0} Dto can't be null
ar: الكيان {0} Dto لا يمكن أن يكون فارغاً
de: Die Entität {0} Dto darf nicht null sein
es: La entidad {0} Dto no puede ser nulo
fr: L’entité {0} Dto ne peut pas être null
he: הישות {0} צריכה אינו יכול להיות null
it: L'entità {0} Dto non può essere null
ja: エンティティ {0} Dto を null にすることはできません。
pt: A entidade {0} Dto não pode ser nulo
zh: 实体{0} D.T.O.不能为null

# EmailNotCorrect
source: The email {0} is not correct
ar: {0} البريد الإلكتروني غير صحيح
de: Die e-Mail {0} ist nicht korrekt
es: El correo electrónico {0} no es correcto
fr: La messagerie {0} n’est pas correct
he: ה דוא ל- {0} אינה נכונה
it: La posta elettronica {0} non è corretto
ja: 電子メール {0} は正しくありません。
pt: O e-mail {0} não é correto
zh: 电子邮件{0}不正确

# Entity
source: Entity {0}
ar: الكيان {0}
de: Entität {0}
es: Entidad {0}
fr: Entité {0}
he: הישות {0}
it: Entità {0}
ja: エンティティ {0}
pt: Entidade {0}
zh: 实体{0}

# EntityNotActive
source: The entity {0} is not active
ar: الكيان {0} غير نشط
de: Das Element {0} ist nicht aktiv
es: La entidad {0} no está activo
fr: L’entité {0} n’est pas actif
he: הישות {0} אינה פעילה
it: L'entità {0} non è attivo
ja: エンティティ {0} はアクティブではありません。
pt: A entidade {0} não está ativo
zh: 实体{0}未处于活动状态

# EntityRequired
source: The entity {0} is required
ar: مطلوب الكيان {0}
de: Das Element {0} ist erforderlich
es: La entidad {0} se requiere
fr: L’entité {0} est requis
he: הישות {0} דרוש
it: L'entità {0} è necessario
ja: エンティティ {0} が必要です。
pt: A entidade {0} é necessária
zh: 实体{0}是必需的

source: Error: Master Objects Can Not support ChildDelete Method
ar: خطأ: سيد الكائنات يمكن أن يعتمد الأسلوب تشيلديليتي
de: Fehler: Master Objekte können nicht unterstützen ChildDelete Methode
es: Error: Maestro objetos puede no apoyar ChildDelete método
fr: Erreur : Maître objets Can prend pas en charge ChildDelete méthode
he: שגיאה: מאסטר אובייקטים לא תומך בשיטה ChildDelete
it: Errore: Master oggetti può non supporta ChildDelete metodo
ja: エラー: マスターのオブジェクトことができますの ChildDelete メソッドをサポートしていません
pt: Erro: Mestre objetos pode não suporte o método ChildDelete
zh: 错误：主对象不能支持子删除方法

# ErrorReadingField0FormTheDataSource
source: Error Reading Field: {0} from the Data Source
ar: خطأ في قراءة حقل: {0} تشكل "مصدر البيانات"
de: Fehler Lesefeld: {0} bilden die Datenquelle
es: Campo de la lectura de error: {0} forman el origen de datos
fr: Erreur lecture champ : {0} constituent la Source de données
he: שגיאה בקריאה השדה: {0} טופס מקור הנתונים
it: Campo di lettura errore: {0} formano l'origine dati
ja: エラー読み取りフィールド: {0} フォーム データ ソース
pt: Campo de leitura de erro: {0} formam a fonte de dados
zh: 从数据源读取字段“{0}”时出错

# EspecificationDataTransferObjectIsNull
source: The specification D.T.O. parameter for entity {0} can not be null
ar: لا يمكن أن تكون المعلمة Dto اسبيسيفيكيشن للوحدة {0} فارغة
de: Parameters Especification Dto für Entität {0} kann nicht null sein.
es: El parámetro Especification Dto entidad {0} no puede ser nulo
fr: Le paramètre Especification Dto pour entité {0} ne peut pas être null
he: הפרמטר Especification צריכה עבור הישות {0} אינו יכול להיות null
it: Il parametro Especification Dto per entità {0} non può essere null
ja: エンティティ {0} の Especification Dto パラメーターを null にすることはできません。
pt: O parâmetro Especification Dto para entidade {0} não pode ser nulo
zh: 规格D.T.O.实体{0}的参数不能为空

# FieldIsRequired
source: The Field {0} of the entity {1} is required
ar: مطلوب الحقل {0} من {1} الكيان
de: Das Feld {0} Entität {1} ist erforderlich
es: El campo {0} de {1} de la entidad es necesario
fr: Le champ {0} de l’entity {1} est requis
he: השדה {0} של ישות הייחודי {1} נדרש
it: Il campo {0} di {1} entità è necessaria
ja: エンティティ {1} のフィールド {0} が必要です。
pt: O campo {0} de {1} a entidade é necessário
zh: 需要实体{1}的字段{0}

# FieldNameRequired
source: The name of the entity { 0} is required
ar: مطلوب اسم الكيان {0}
de: Der Name der Entität {0} ist erforderlich
es: El nombre de la entidad {0} es necesario
fr: Le nom de l’entité {0} est requis
he: דרוש שם הישות {0}
it: È necessario il nome dell'entità {0}
ja: エンティティ {0} の名前が必要
pt: O nome da entidade {0} é necessário
zh: 实体{0}的名称是必需的

# Founded
source: {0} Founded
ar: تأسست {0}
de: {0} gegründet
es: {0} fundada
fr: {0} fondée
he: {0} נוסדה
it: {0} fondata
ja: {0} 設立
pt: {0} fundado
zh: {0}成立

source: Identity can not be null.
ar: لا يمكن أن تكون هوية فارغة.
de: Identität kann nicht null sein.
es: Identidad no puede ser nula.
fr: Identité ne peut pas être nulle.
he: זהות אינו יכול להיות null.
it: Identità non può essere null.
ja: アイデンティティを null にすることはできません。
pt: Identidade não pode ser nula.
zh: 身份不能为空。

# IEndpointBehaviorTypeSpecifiedMustHaveAPublicEmptyConstructor
source: IEndpointBehaviorType specified in the FlatWsdlServiceBehaviorAttribute constructor must have a public empty constructor.
ar: يجب أن يكون إييندبوينتبيهافيورتيبي المحدد في منشئ فلاتوسدلسيرفيسيبيهافيوراتريبوتي دالة إنشائية عامة فارغة.
de: IEndpointBehaviorType in der FlatWsdlServiceBehaviorAttribute-Konstruktor angegeben müssen einen öffentlichen Konstruktor leeren.
es: IEndpointBehaviorType especificado en el constructor de FlatWsdlServiceBehaviorAttribute debe tener un constructor público vacío.
fr: IEndpointBehaviorType spécifié dans le constructeur de FlatWsdlServiceBehaviorAttribute doit avoir un constructeur public vide.
he: IEndpointBehaviorType שצוין בהבנאי FlatWsdlServiceBehaviorAttribute חייב להיות בנאי ריק ציבורי.
it: IEndpointBehaviorType specificato nel costruttore FlatWsdlServiceBehaviorAttribute deve avere un costruttore pubblico vuoto.
ja: IEndpointBehaviorType FlatWsdlServiceBehaviorAttribute コンス トラクターで指定された空のパブリック コンス トラクターが必要です。
pt: IEndpointBehaviorType especificado no Construtor FlatWsdlServiceBehaviorAttribute deve ter um construtor público vazio.
zh: 在FlatWsdlServiceBehaviorAttribute构造函数中指定的IEndpointBehavior类型必

# InvalidConnectionStringId
source: Invalid ConnectionStringId ({0})
ar: كونيكتيونسترينجيد غير صالح ({0})
de: Ungültige ConnectionStringId ({0})
es: ConnectionStringId no válida ({0})
fr: ConnectionStringId non valide ({0})
he: ConnectionStringId לא חוקי ({0})
it: ConnectionStringId non valido ({0})
ja: 無効な ConnectionStringId ({0})
pt: ConnectionStringId inválido ({0})
zh: 须具有公共的空构造函数。

# IsNotTransient
source: The entity {0} has to be transient, their Id has to have the default value.
ar: الكيان {0} قد تكون عابرة، وهوية يجب أن تكون القيمة الافتراضية.
de: Die Entität {0} transient sein, ihre Id muss den Standardwert haben.
es: La entidad {0} debe ser transitoria, su identificación debe tener el valor por defecto.
fr: L’entité {0} doit être transitoire, leur carte d’identité doit avoir la valeur par défaut.
he: הישות {0} חייב להיות ארעית, מזהה שלו צריך להיות ערך ברירת המחדל.
it: L'entità {0} deve essere transitoria, loro Id deve avere il valore predefinito.
ja: エンティティ {0} が一過性のもの、自分の Id が既定値を持っています。
pt: A entidade {0} deve ser transitório, sua identificação deve ser o valor padrão.
zh: 无效的ConnectionStringId（{0}）

# IsRequired
source: {0} is required
ar: مطلوب {0}
de: {0} ist erforderlich
es: {0} es necesario
fr: {0} n’est requise
he: {0} דרוש
it: {0} è necessario
ja: {0} が必要です。
pt: {0} é necessária
zh: {0}是必需的

source: LinqEntityAttribute not defined.
ar: لينقينتيتياتريبوتي غير محددة.
de: LinqEntityAttribute nicht definiert.
es: LinqEntityAttribute no definido.
fr: LinqEntityAttribute non défini.
he: LinqEntityAttribute אינו מוגדר.
it: LinqEntityAttribute non definito.
ja: LinqEntityAttribute が定義されていません。
pt: LinqEntityAttribute não definido.
zh: Linq实体属性未定义。

# MapperErrorEntityNull
source: Mapping error for entity '{0}'. Input parameter null not allowed.
ar: خطأ في تعيين للكيان '{0}'. معلمة الإدخال فارغة غير مسموح.
de: Zuordnungsfehler für Entität "{0}". Eingabeparameter null nicht zulässig.
es: Error de asignación para la entidad '{0}'. Parámetro de entrada null no permitido.
fr: Erreur de mappage pour l’entité « {0} ». Paramètre d’entrée null non autorisé.
he: שגיאת מיפוי עבור הישות '{0}'. Null פרמטר קלט אינו מותר.
it: Errore di mapping per l'entità '{0}'. Parametro di input null non consentito.
ja: エンティティ '{0}' のマッピング エラーです。入力パラメーターの null は使用できません。
pt: Erro de mapeamento para a entidade '{0}'. Parâmetro de entrada nulo não permitido.
zh: 实体“{0}”的映射错误。不允许输入参数null。

source: maxPoolSize cannot be negative
ar: ماكسبولسيزي لا يمكن أن تكون سلبية
de: MaxPoolSize darf nicht negativ sein.
es: maxPoolSize no puede ser negativo
fr: maxPoolSize ne peut pas être négatif
he: maxPoolSize אינו יכול להיות שלילי
it: maxPoolSize non può essere negativo
ja: maxPoolSize は負の値にすることはできません。
pt: maxPoolSize não pode ser negativo
zh: 最大池大小不能为负

source: minPoolSize cannot be greater than maxPoolSize
ar: مينبولسيزي لا يمكن أن تكون أكبر من ماكسبولسيزي
de: MinPoolSize darf nicht größer als MaxPoolSize sein.
es: minPoolSize no puede ser mayor a maxPoolSize
fr: minPoolSize ne peut pas être supérieure à maxPoolSize
he: minPoolSize אינו יכול להיות גדול מ- maxPoolSize
it: minPoolSize non può essere maggiore di maxPoolSize
ja: minPoolSize は maxPoolSize より大きくすることはできません。
pt: minPoolSize não pode ser superior a maxPoolSize
zh: min池大小不能大于max Pool Size

source: minPoolSize cannot be negative
ar: مينبولسيزي لا يمكن أن تكون سلبية
de: MinPoolSize darf nicht negativ sein.
es: minPoolSize no puede ser negativo
fr: minPoolSize ne peut pas être négatif
he: minPoolSize אינו יכול להיות שלילי
it: minPoolSize non può essere negativo
ja: minPoolSize は、否定することはできません。
pt: minPoolSize não pode ser negativo
zh: min池大小不能为负

# Modify
source: Modify {0}
ar: تعديل {0}
de: Ändern Sie {0}
es: Modifique {0}
fr: Modifiez {0}
he: לשנות {0}
it: Modificare {0}
ja: {0} を変更します。
pt: Modificar {0}
zh: 修改{0}

# MustBeGreaterOrEqualThan1
source: {0} must be greater or equal than {1}
ar: {0} يجب أن تكون أكبر أو تساوي من {1}
de: {0} muss größer oder gleich als {1} sein.
es: {0} debe ser mayor o igual a {1}
fr: {0} doit être supérieur ou égal à {1}
he: {0} חייב להיות גדול או שווה מ- {1}
it: {0} deve essere maggiore o uguale {1}
ja: {0} は {1} よりも大きいか等しいをある必要があります。
pt: {0} deve ser maior ou igual que {1}
zh: {0}必须大于或等于{1}

# NameCannotBeNull
source: The name can not be null.
ar: لا يمكن أن يكون الاسم فارغاً.
de: Name kann nicht null sein.
es: Nombre no puede ser null.
fr: Nom ne peut pas être null.
he: השם אינו יכול להיות null.
it: Nome non può essere null.
ja: 名前を null にすることはできません。
pt: Nome não pode ser nulo.
zh: 名称不能为空。

source: Name Of User
ar: اسم المستخدم
de: Name des Benutzers
es: Nombre de usuario
fr: Nom d’utilisateur
he: שם המשתמש
it: Nome dell'utente
ja: ユーザーの名前
pt: Nome de usuário
zh: 用户名

# NoDataById
source: there is not {0} with this id {1}
ar: لا يوجد {0} مع هذا معرف {1}
de: Es gibt keine {0} mit dieser Id {1}
es: no es {0} con este identificador {1}
fr: Il n’y a pas de {0} avec cet id {1}
he: אין {0} עם {1} מזהה זה
it: non c'è {0} con questo id {1}
ja: この id {1} の {0} がありません。
pt: Não há {0} com esta identificação {1}
zh: 不存在具有此标识{1}的{0}

# Object
source: Object {0}
ar: الكائن {0}
de: Objekt {0}
es: Objeto {0}
fr: Objet {0}
he: האובייקט {0}
it: Oggetto {0}
ja: オブジェクト {0}
pt: Objeto {0}
zh: 对象{0}

source: Object is not Child and can not be saved
ar: الكائن ليس من الطفل ولا يمكن حفظ
de: Objekt ist kein Kind und kann nicht gespeichert werden
es: Objeto no es niño y no se puede guardar
fr: Objet n’est pas un enfant et ne peut pas être sauvé
he: האובייקט אינו ילד, אין אפשרות לשמור
it: Oggetto non è bambino e non possa essere salvata
ja: オブジェクトの子ではないと保存できません。
pt: Objeto não é criança e não pode ser salvo
zh: 对象不是子对象，无法保存

source: Object is not valid and can not be saved
ar: الكائن غير صالح ولا يمكن حفظ
de: Objekt ist ungültig und kann nicht gespeichert werden
es: Objeto no es válido y no se puede guardar
fr: Objet n’est pas valide et ne peut pas être sauvé
he: אובייקט זה אינו תקף, לא ניתן לשמור
it: Oggetto non è valido e non può essere salvato
ja: オブジェクトが無効と保存できません。
pt: Objeto não é válido e não pode ser salvo
zh: 对象无效，无法保存

source: Object is still being edited and can not be saved
ar: لا يزال يتم تحرير الكائن، ولا يمكن حفظ
de: Objekt wird noch bearbeitet und kann nicht gespeichert werden
es: Objeto todavía está siendo editado y no se puede guardar
fr: Objet est toujours en cours d’édition et ne peut pas être sauvé
he: האובייקט עדיין נמצאת במצב עריכה, לא ניתן לשמור
it: Oggetto è ancora in fase di modifica e non possa essere salvata
ja: オブジェクトを編集していると保存できません。
pt: Objeto ainda está sendo editado e não pode ser salvo
zh: 对象仍在编辑中，无法保存

source: Ok
ar: موافق
de: Okay
es: Vale
fr: Bien
he: אוקיי
ja: わかりました
pt: Okey
zh: 好

source: page must be greater or equal to 1
ar: يجب أن تكون الصفحة أكبر أو يساوي 1
de: Seite muss größer oder gleich 1 sein.
es: Página debe ser mayor o igual a 1
fr: page doit être supérieur ou égal à 1
he: דף להיות גדול או שווה ל- 1
it: pagina deve essere maggiore o uguale a 1
ja: ページが 1 以上にする必要があります。
pt: página deve ser maior ou igual a 1
zh: 页面必须大于或等于1

source: Password
ar: كلمة المرور
de: Passwort
es: Contraseña
fr: Mot de passe
he: סיסמה
ja: パスワード
pt: Senha
zh: 密码

# PropertyRequired
source: The property {0} in entity {1} is required
ar: مطلوب الخاصية {0} في الكيان {1}
de: Die Eigenschaft {0} {1} Entität ist erforderlich
es: El propiedad {0} de {1} entidad es necesario
fr: La propriété {0} dans {1} entité est nécessaire
he: המאפיין {0} בישות {1} נדרש
it: La proprietà {0} nell'entità {1} è richiesto
ja: エンティティ {1} のプロパティ {0} が必要です。
pt: A propriedade {0} em {1} entidade é necessário
zh: 实体{1}中的属性{0}是必需的

source: Read
ar: قراءة
de: Lesen Sie
es: Leer
fr: Lire
he: קריאה
it: Lettura
ja: 読み取り
pt: Leitura
zh: 读

# Readed
source: {0} readed
ar: readed {0}
de: {0} gelesene
es: leído {0}
fr: {0} lues
it: {0} ' letti
ja: {0} を読み込もう
pt: readed {0}
zh: {0}已读

# Repeated
source: The {0} is repeated.
ar: ويتكرر {0}.
de: {0} wird wiederholt.
es: El objeto {0} se repite.
fr: Le {0} est répété.
he: {0} הוא חזר.
it: {0} è ripetuto.
ja: {0} が繰り返されます。
pt: O {0} é repetido.
zh: 重复{0}。

source: Save
ar: حفظ
de: Speichern Sie
es: Guardar
fr: Enregistrer
he: להציל את
it: Salvare
ja: を保存します。
pt: Salvar
zh: 保存

# Saved
source: {0} Saved
ar: {0} المحفوظة
de: {0} gespeichert
es: {0} guardado
fr: {0} sauvés
he: {0} נשמר
ja: {0} の保存
zh: {0}已保存

source: Search
ar: البحث {0}
de: Suche
es: Buscar
fr: Recherche
he: חיפוש
it: Ricerca
ja: 検索
pt: Pesquisar
zh: 搜索

# Type0CannotBeUnregisteredBecauseThereAreActiveThreadsWaitingForAnObject
source: The type {0} cannot be unregistered because there are active threads waiting for an object.
ar: لا يمكن أن يكون النوع {0} غير مسجلة لأن هناك مؤشرات الترابط النشطة في انتظار كائن.
de: Typ {0} kann nicht aufgehoben werden, denn es gibt aktive Threads warten auf ein Objekt.
es: El tipo {0} no puede ser no registrados porque hay subprocesos activos a la espera de un objeto.
fr: Le type {0} ne peut pas être annulée parce qu’il y a des threads actifs en attente pour un objet.
he: לסוג {0} אינו יכול להיות לא רשום כי יש חוטי פעיל מחכה אובייקט.
it: Il tipo {0} non può essere annullata la registrazione perché ci sono thread attivi in attesa di un oggetto.
ja: 型 {0} は、オブジェクトを待機しているアクティブなスレッドがあるので登録を解除できません。
pt: O tipo {0} não pode ser cancelado porque há segmentos ativos à espera de um objeto.
zh: 类型{0}无法注销，因为有活动线程正在等待对象。

source: Type {0} is not registered in the object pool
ar: لم يتم تسجيل النوع {0} في تجمع الكائن
de: Typ {0} ist nicht in der Objektpool registriert.
es: Tipo {0} no está registrado en la piscina de objeto
fr: Le type {0} n’est pas enregistré dans le pool d’objets
he: הסוג {0} אינו רשום בבריכה אובייקט
it: Il tipo {0} non è registrato nel pool di oggetti
ja: オブジェクト プールの種類 {0} が登録されていません
pt: O tipo {0} não está registrado no pool de objeto
zh: 类型{0}未在对象池中注册

source: Type cannot be null.
ar: النوع لا يمكن أن تكون فارغة.
de: Typ kann nicht null sein.
es: Tipo no puede ser null.
fr: Type ne peut pas être null.
he: סוג אינו יכול להיות null.
it: Tipo non può essere null.
ja: 型を null にすることはできません。
pt: Tipo não pode ser nulo.
zh: 类型不能为null。

# TypeIsAlreadyRegisteredInTheObjectPool
source: Type {0} is already registered in the object pool
ar: النوع {0} مسجل بالفعل في تجمع الكائن
de: Typ {0} ist bereits in der Objektpool registriert.
es: Tipo {0} ya está registrado en la piscina de objeto
fr: Le type {0} est déjà enregistré dans le pool d’objets
he: הסוג {0} כבר רשום בבריכה אובייקט
it: Il tipo {0} è già registrato nel pool di oggetti
ja: 型 {0} は既にオブジェクト プールに登録されて
pt: O tipo {0} já está registrado na piscina objeto
zh: 类型{0}已在对象池中注册

# UnableToReadKeyOrIv
source: Unable to read key or Id
ar: غير قادر على قراءة المفتاح أو معرف
de: Nicht in der Lage, Schlüssel oder Id lesen
es: No se puede leer la clave o Id
fr: Impossible de lire la clé ou Id
he: אין אפשרות לקרוא מפתח או מזהה
it: Impossibile leggere la chiave o Id
ja: キーまたは Id を読み取ることができません。
pt: Não é possível ler a chave ou Id
zh: 无法读取密钥或ID

source: Unable to start provider
ar: غير قادر على بدء تشغيل موفر
de: Konnte nicht Anbieter gestartet
es: No se puede iniciar el proveedor
fr: Impossible de démarrer le fournisseur
he: אין אפשרות להפעיל ספק
it: Impossibile avviare il provider
ja: プロバイダーを開始できません。
pt: Não é possível iniciar o provedor
zh: 无法启动提供商
